from band_determinant import BandDeterminant


class BDGenerator:
    """Генерирует условия для задачи о ленточном определителе
    методом неопределенных коэффициентов

    Корни характеристического уравнения выбираются из указанного диапазона,
    на основании подобранных корней по теореме Виета вычисляются значения
    для диагоналей матрицы и коэффициенты рекуррентного уравнения.
    Для того, чтобы получить удобное решение корни подбираются так,
    чтобы коэффициенты рекуррентного уравнения были целыми числами
    или простыми дробями.
    """

    def generate_brand_determinant(
        self, low_bound: int, high_bound: int
    ) -> BandDeterminant:
        """
        Генерирует условия для задачи о ленточном определителе методом
        неопределенных коэффициентов

        Args:
            low_bound (int): нижняя граница диапазона для выбора корней
                характеристического уравнения
            high_bound (int): верхняя граница диапазона для выбора корней
                характеристического уравнения
        """
        pass
