def stars_and_bars(n: int, k: int) -> list[str]:
    """Возвращает все представления распределений k одинаковых предметов
    по n различимым ящикам в формате «звёзды и перегородки».
    Реализована рекурсивно.

    Каждая строка состоит из k символов '*' и n-1 символа '|', без пробелов.
    Пустые ящики допускаются. Порядок строк в списке не регламентируется.

    :param n: число ящиков, целое не меньше 1
    :param k: число предметов, целое неотрицательное
    :raises Exception: если хотя бы одно среди n и k не является целым числом
    :raises Exception: если n < 1 или k < 0
    :return: список строк
    """
    check_constr(n, k)

    return gen_distib(n - 1, k)

def check_constr(n: int, k: int) -> None:
    """Проверяет входные данные на корректность для задачи 
    генерации представления распределения k одинаковых предметов по n 
    различным ящикам.

    Поочередно проверяется каждый случай
    """
    if type(n) != type(2) or type(k) != type(2):
        raise Exception("оба значения должны быть целочисленными")

    if n < 1 or k < 0:
        raise Exception("аргументы должны подчиняться следующим условиям:\
                          n >= 1, k >= 0")

def gen_distib(n: int, k: int) -> list[str]:
    """Рекурсивная функция для генерации всевозможного распределения 
    k неразличимых преметов по n различимым ящикам.
    Реализация рекурсивная.

    На каждом шагу мы прибавляем к текущему префиксу всевозможные подходящие 
    суффиксы, которые совокупно удовлетворяют условиям на число ящиков и предметов.
    В базовом случае, при обнулении одного из параметров мы за неимением альтернатив 
    возвращем суффикс по оставшемуся параметру
    
    """
    if k < 1:
        return ["|" * n]
    if n < 1:
        return ["*" * k]

    first_part = ["*" + el for el in gen_distib(n, k - 1)]
    second_part = ["|" + el for el in gen_distib(n - 1, k)]

    return first_part + second_part

def main():
    n = 3
    k = 2
    print(f"Распределения {k} предметов по {n} ящикам:")
    for item in stars_and_bars(n, k):
        print(item)


if __name__ == "__main__":
    main()
